tabla:
Column           Type            Nullable
user_id          int             NO
name             varchar(50)     NO
surname          varchar(100)    YES
age              int             YES
init_date        date            YES
email            varchar         YES

'''COMENTARIOS'''

/*
Este es un comentario
*/

'''CONSULTA DE DATOS'''

# SELECT

SELECT * FROM tabla;
Selecciona todos los datos de la tabla

SELECT name FROM tabla;
Selecciona el campo o columna elegida con sus datos

SELECT id, name FROM tabla;
Selecciona dos campos o columnas elegidas con sus datos

'''MODIFICADORES'''

# DISTINCT

SELECT DISTINCT * FROM tabla;
Selecciona todos los campos diferentes en la tabla, con sus datos

SELECT DISTINCT age FROM tabla;
Selecciona los valores distintos en el campo especificado

# WHERE

SELECT * FROM tabla WHERE age = 15;
Selecciona las filas donde se cumpla la condicion en el campo especificado

SELECT name * FROM tabla WHERE age = 15;
Selecciona los datos de los campos que coincidan con el condicional

# ORDER BY

SELECT * FROM tabla ORDER BY age;
Selecciona todos los datos, ordenados por campo especificado

SELECT * FROM tabla ORDER BY age DESC;
Selecciona todos los datos, ordenados de forma descendente por campo especificado

SELECT * FROM tabla WHERE email='das@gmail.com' ORDER BY age DESC;
Selecciona todas las filas que coincidan con el dato especificado en x campo, y ordenadas por edad

SELECT name FROM tabla WHERE email='das@gmail.com' ORDER BY age DESC;
Selecciona los datos del campo especifico, que coincida con el condicional, ordenado por edad

# LIKE

SELECT * FROM tabla WHERE email LIKE = '%gmail.com';
Selecciona coincidencias en campo especifico, el '%' solo toma en cuenta lo que hay despues de el

SELECT * FROM tabla WHERE email LIKE = 'das%';
Selecciona coincidencias en campo especifico, el '%' solo toma en cuenta lo que hay antes de el

SELECT * FROM tabla WHERE email LIKE = '%@%';
Selecciona coincidencias en campo especifico, el '%' solo toma en cuenta lo que hay emtre el

# AND, OR, NOT

SELECT * FROM tabla WHERE NOT email = 'das@gmail.com';
Excluye las filas que coincidan en el valor especifico

SELECT * FROM tabla WHERE NOT email = 'das@gmail.com' AND edad = 15;
Selecciona las filas que no coincidan con el primer valor y que coincidan con el segundo

SELECT * FROM tabla WHERE NOT email = 'das@gmail.com' OR edad = 15;
Selecciona las filas que cumplan cualquiera de las dos condiciones

# LIMIT

SELECT * FROM table LIMIT 2;
Limita la muestra de datos al parametro especificado

SELECT * FROM tabla WHERE NOT email = 'das@gmail.com' OR edad = 15 LIMIT 3;

# NULL

SELECT * FROM table WHERE email IS NULL;
Selecciona las filas que coincidan con el valor nulo

SELECT * FROM table WHERE email IS NOT NULL;

SELECT * FROM table WHERE email IS NOT NULL AND adad = 15;
Selecciona las filas que coincidan con las condicionales

# MIN, MAX

SELECT MAX(edad) FROM tabla;
Selecciona el valor maximo en el campo especificado

SELECT MIN(edad) FROM tabla;
Selecciona el valor minimo en el campo especificado

# COUNT

SELECT COUNT(edad) FROM tabla;
Cuenta los valores encontrados (no nulos) en campo especifico

SELECT COUNT(*) FROM tabla;
Cuenta las filas en la tabla

# SUM

SELECT SUM(edad) FROM tabla;
Suma los valores en campo especifico

# AVG

SELECT AVG(edad) FROM tabla;
Obtiene el promedio de los valores en campo especifico

# IN

SELECT * FROM tabla WHERE name IN('Daniel', 'Sara');
Selecciona valores concretos en campos especificos. No es case sensitive

# BETWEEN

SELECT * FROM tabla WHERE edad BETWEEN 20 AND 30;
Para rangos

# ALIAS (AS)

SELECT name, fecha AS 'Fecha de inicio' FROM tabla WHERE name = 'Daniel';
Se da un alias al campo elegido (fecha)

# CONCAT

SELECT CONCAT('name, ' ', apellido) FROM tabla;
Crea un nuevo campo. Concatena dos campos, (' ') deja un espacio vacio

SELECT CONCAT('Nombre: ', name, ' Apellidos: ', apellido) AS nombre completo FROM tabla;
Se puede dar formato

# GROUP BY

SELECT MAX(age) * FROM tabla GROUP BY age;
El campo que se agrupa es el mismo en que se ejecuta la funcion

SELECT COUNT(age) * FROM tabla GROUP BY age;

SELECT COUNT(age), age * FROM tabla GROUP BY age;
Se muestra el conteo de las edades, y las edades en dos campos diferentes

SELECT COUNT(age), age * FROM tabla GROUP BY age ORDER BY age ASC;
Ahora se ordena de forma ascendente

SELECT COUNT(age), age * FROM tabla WHERE age > 15 GROUP BY age ORDER BY age ASC;
Ahhora muestra las edades mayores a 15

# HAVING

SELECT * FROM tabla HAVING age > 15;
Delimita la busqueda, aqui solo mayores de 15

SELECT COUNT(age) FROM tabla HAVING COUNT(age) > 3;
Delimita la busqueda dentro de otro modificador (solo si hay mas de 3 edades, en este ej.)

# CASE

SELECT *,  # la coma es necesaria
CASE
    WHEN age > 18 THEN 'Es mayor de edad'
    ELSE 'Es menor de edad'
END AS agetext  # el alias siempre da nombre al campo o col elegido (age).
FROM tabla;

'''CASE desata un caso logico como en python'''

SELECT *,
CASE
    WHEN age = 18 THEN 'Es mayor de edad'
    WHEN age > 18 THEN 'Es aun mayor'
    ELSE 'Es menor de edad'
END AS agetext
FROM tabla;

SELECT *,
CASE
    WHEN age > 18 THEN True
    ELSE False
END AS agetext 
FROM tabla;

'''Se puede mostrar un valor booleano tambien'''

# IFNULL

SELECT IFNULL(NULL, 'Es nulo');
Regresa el valor si la expresion es NULL

SELECT name, surname, IFNULL(age, 0) FROM tabla;
Asigna un valor(0) si el dato en el campo(age) es nulo (NULL)

SELECT name, surname, IFNULL(age, 0) AS AliasDeAge FROM tabla;
Da un alias a la columna age

# IS NULL

SELECT ISNULL(NULL);
Si la expresion en NULL regresa 1, de lo contrario 0

'''****INSERT****'''

INSERT INTO  tabla(user_id, name, surname) VALUES(8, 'Maria', 'Lopez);
Insertando de forma manual el id del usuario (incluso si hay 6 usuarios)

INSERT INTO  tabla(name, surname) VALUES('Paco', 'Perez);
Usando el autoincrement para que el id se asigne solo

# UPDATE

UPDATE tabla SET age = 21 WHERE user_id = 11;
Siempre se hacen con una regla de filtrado. Por defecto con un WHERE

UPDATE tabla SET age = 20, init_date = '2020-10-12' WHERE user_id = 11;

# DELETE

DELETE FROM tabla WHERE user_id = 11;

'''*************ADMINISTRACION DE DB*************'''

# Crear base de datos 'test'
CREATE DATABASE test;

# Borrar base de datos 'test'
DROP DATABASE test;

'''*************ADMINISTRACION DE TABLAS*************'''

# Crear tabla 'personas'
CREATE TABLE personas (
    id int,
    name varchar(100),
    age int,
    email varchar(50),
    created date
);

'''*************RESTRICCIONES*************'''

# NOT NULL (no nulo, no vacio)

CREATE TABLE personas2 (
    id int NOT NULL,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created date
);

# UNIQUE

CREATE TABLE personas3 (
    id int NOT NULL,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created date,
    UNIQUE(id)
);
Ahora id es un campo unico, no se puede repetir

# PRIMARY KEY

CREATE TABLE personas4 (
    id int NOT NULL,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created date,
    UNIQUE(id),
    PRIMARY KEY(id)
);
Clave primaria de la tabla

# CHECK

CREATE TABLE personas5 (
    id int NOT NULL,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created date,
    UNIQUE(id),
    PRIMARY KEY(id),
    CHECK(age>=18)
);
Criterio al hacer la tabla: Solo usuarios mayores de 18 anios

# DEFAULT

CREATE TABLE personas6 (
    id int NOT NULL,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created datetime DEFAULT CURRENT_TIMESTAMP(),
    UNIQUE(id),
    PRIMARY KEY(id),
    CHECK(age>=18)
);
Valor por defecto. En este caso intenta traer a la fecha y hora del sistema

# AUTO_INCREMENT

CREATE TABLE personas7 (
    id int NOT NULL AUTO_INCREMENT,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created datetime DEFAULT CURRENT_TIMESTAMP(),
    UNIQUE(id),
    PRIMARY KEY(id),
    CHECK(age>=18)
);
El numero de ID incrementa en automatico

# DROP TABLE

DROP TABLE persons7;
Borrar una tabla

'''*****ALTER TABLE*****''' Alterar una tabla

CREATE TABLE personas7 (
    id int NOT NULL AUTO_INCREMENT,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created datetime DEFAULT CURRENT_TIMESTAMP(),
    UNIQUE(id),
    PRIMARY KEY(id),
    CHECK(age>=18)
);

ALTER TABLE persons7;
ADD surname varchar(150); (agregar nuevo campo)

ALTER TABLE persons7;
RENAME COLUMN surname TO descripcion; (de surname a descripcion)

ALTER TABLE persons7;
MODIFY COLUMN descripcion varchar(250); (de 150 a 250 caracteres)

CREATE TABLE personas7 (
    id int NOT NULL AUTO_INCREMENT,
    name varchar(100) NOT NULL,
    age int,
    email varchar(50),
    created datetime DEFAULT CURRENT_TIMESTAMP(),
   *descripcion varchar(250)*
    UNIQUE(id),
    PRIMARY KEY(id),
    CHECK(age>=18)
);

ALTER TABLE persons7;
DROP COLUMN descripcion; (eliminar)

'''**********TIPOS DE RELACIONES**********'''
Partimos de la base de que todos los elementos principales (primary key) en una tabla
tienen un identificador (id)

Relacion 1:1 (uno a uno)
Un elemento de la tabla A solo puede relacionarse con uno de la tabla B,
y viceversa.
Ej. Un elemento X (tabla A) solo puede tener un elemento Y (tabla B),
y un elemento Y solo puede estar asociado a un elemento X. 
El foreign key en tabla B es el id en tabla A.

Relacion 1:N (uno a varios)
Un elemento en tabla A puede relacionarse a varios en tabla B.
Ej. Una empresa en tabla A se relaciona a varios empleados en tabla B.

Relacion N:M (muchos a muchos)
Un id en A puede relacionarse a varios id's en B, la diferencia con la anterior
es que aqui el mismo id en B puede relacionarse a varios id's en A.

Ej. Programador 1 sabe lenguaje 1, 2 y 3. Programador 2 sabe lenguaje 1, 3 y 5.
Y asi con mas miembros de las tablas.

Se relacionan mediante una tabla intermedia que guarda los id's de A y B.
Tabla A   Tabla intermedia (id A-id's en B)   Tabla B
1                1-1,3,4                         1
2                2-1,2                           2
3                3-2                             3
4                4-1,3,4                         4

Relacion de Autoreferencia

Relacion que indica que un elemento de la tabla A puede relacionarse con otro
registro de la tabla A.

Ej. En una tabla donde se guardan los jefes en una empresa, el jefe de todos es el 5,
el jefe 1 tiene como jefe al 5, el jefe 2 al 5, el jefe 3 al 4 y 5, el jefe 4 al 5.

'''**********CREACION DE TABLAS RELACIONADAS**********'''

# TABLA 1:1

CREATE TABLE dni(
    dni_id int AUTO_INCREMENT PRIMARY KEY,
    dni_number int NOT NULL,
    user_id int,
    UNIQUE(dni_id),
    FOREIGN KEY(user_id) REFERENCES users(user_id)
);

El FOREIGN KEY es el id en tabla users. y REFERENCES indica de que tabla
y de que campo sacamos el foreign key.

# TABLA 1:N

CREATE TABLE companies(
    company_id int AUTO_INCREMENT PRIMARY KEY,
    name varchar(100) NOT NUL
);

CREATE TABLE users (
    user_id int NOT NULL AUTO_INCREMENT PRIMARY,
    name varchar(50) NOT NULL,
    surname varchar(100),
    age int,
    init_date date,
    email varchar(50),
    UNIQUE(user_id),
);
# Se agrega foreign key
ALTER TABLE users
ADD CONSTRAINT fk_companies  #fk es corto reservado para foreign key
FOREIGN KEY(company_id) REFERENCES companies(company_id);

# TABLA N:M

CREATE TABLE users_languages(
    users_language_id int AUTO_INCREMENT PRIMARY KEY,
    user_id int NOT NULL,
    language_id int NOT NULL,
    FOREIGN KEY(user_id) REFERENCES users(user_id),
    FOREIGN KEY(language_id) REFERENCES languages(language_id),
    UNIQUE(user_id, language_id)
);
Esta tabla guarda los id's de otras dos tablas, y lo hace en formato FOREIGN KEY

'''**********DATOS RELACIONADOS**********'''

Datos 1:1       Campos a insertar    valores respectivos
INSERT INTO dni(dni_number, user_id) VALUES(11111, 1);
INSERT INTO dni(dni_number, user_id) VALUES(22222, 2);
INSERT INTO dni(dni_number, user_id) VALUES(33333, 3);
INSERT INTO dni(dni_number) VALUES(44444);

Datos 1:N 
INSERT INTO companies(name) VALUES('Company uno');
INSERT INTO companies(name) VALUES('Company dos');
INSERT INTO companies(name) VALUES('Company tres');

UPDATE users SET company_id = 1 WHERE user_id = 1;
UPDATE users SET company_id = 2 WHERE user_id = 3;
UPDATE users SET company_id = 3 WHERE user_id = 4;
UPDATE users SET company_id = 4 WHERE user_id = 7;

# Datos N:M

INSERT INTO languages(name) VALUES('Python');
INSERT INTO languages(name) VALUES('Swift');
INSERT INTO languages(name) VALUES('Java');
INSERT INTO languages(name) VALUES('Kotlin');
INSERT INTO languages(name) VALUES('JavaScript');

'''**********CONSULTA DE RELACIONES**********'''

# INNER JOIN (en la mayoria de base de datos es lo mismo que JOIN)
Obtiene los datos comunes en dos tablas(cuando hay coincidencias en ambas tablas)

# 1:1
SELECT * FROM users
INNER JOIN dni ON users.user_id = dni.user_id;

Crea una tabla uniendo las dos tablas donde
el user_id en tabla users sea igual al user_id en tabla dni

SELECT name, dni_number FROM users
JOIN dni ON users.user_id = dni.user_id
ORDER BY age ASC;

Selecciona nombre y numero de dni, los une como la anterior y los ordena por edad ascendente.
Y mas.

#1:N (ej. los usuarios trabajan en diferentes companias)
SELECT * FROM users
JOIN companies ON users.company_id = companies.company_id;

SELECT companies.name, users.name FROM companies
JOIN users ON companies.company_id = users.company_id;

Join de tres tablas 

# TABLA N:M

CREATE TABLE users_languages(
    users_language_id int AUTO_INCREMENT PRIMARY KEY,
    user_id int NOT NULL,
    language_id int NOT NULL,
    FOREIGN KEY(user_id) REFERENCES users(user_id),
    FOREIGN KEY(language_id) REFERENCES languages(language_id),
    UNIQUE(user_id, language_id)
);

SELECT *
FROM users_languages(1)
JOIN users(2) ON users_languages.user_id = users.user_id
JOIN languages(3) ON users_languages.language_id = languages.language_id;

Une tabla (1) con tabla (2) segun la condicion, y tabla (1) con tabla (3) segun la condicion.
Y forma nueva tabla con todos los campos.

SELECT users.name, languages.name
FROM users_languages
JOIN users ON users_languages.user_id = users.user_id
JOIN languages ON users_languages.language_id = languages.language_id;

Se crea una nueva tabla donde se muestran los nombres relacionados por las condiciones

# LEFT JOIN (LEFT OUTER JOIN en otras bases de datos)
Se queda con los datos de la tabla izquierda (la primera)

SELECT * FROM users
LEFT JOIN dni 
ON users.user_id = dni.user_id;

SELECT name, dni_number FROM users
LEFT JOIN dni 
ON users.user_id = dni.user_id;

SELECT users.name, languages.name
FROM users_languages
LEFT JOIN users ON users_languages.user_id = users.user_id
LEFT JOIN languages ON users_languages.language_id = languages.language_id;

# RIGHT JOIN (RIGHT OUTER JOIN en otras bases de datos)
Se queda con los datos de la tabla derecha (la segunda)

SELECT * FROM users
RIGHT JOIN dni 
ON users.user_id = dni.user_id;

SELECT users.name, languages.name
FROM users_languages
RIGHT JOIN users ON users_languages.user_id = users.user_id
RIGHT JOIN languages ON users_languages.language_id = languages.language_id;

# FULL JOIN (FULL OUTER JOIN en otras bases de datos)
Se queda con todo, haya datos o no
En mySQL no existe

SELECT * FROM users
FULL JOIN dni 
ON users.user_id = dni.user_id;

SELECT users.name, languages.name
FROM users_languages
FULL JOIN users ON users_languages.user_id = users.user_id
FULL JOIN languages ON users_languages.language_id = languages.language_id;

# UNION
-- elimina duplicados

-- Obtiene todos los id de usuarios de las tablas dni y usuarios (exista o no relación)

SELECT users.user_id AS u_user_id, dni.user_id AS d_user_id
FROM users
LEFT JOIN dni
ON users.user_id = dni.user_id
UNION
SELECT users.user_id AS user_id, dni.user_id AS d_user_id
FROM users
RIGHT JOIN dni
ON users.user_id = dni.user_id;

-- Obtiene todos los datos de las tablas dni y usuarios (exista o no relación)
SELECT *
FROM users
LEFT JOIN dni
ON users.user_id = dni.user_id
UNION
SELECT *
FROM users
RIGHT JOIN dni
ON users.user_id = dni.user_id;

-- UNION ALL mantiene duplicados

'''**********CONCEPTOS AVANZADOS**********'''

# INDEX
-- Nos permite indexar la tabla
-- Hace que la tabla pese mas.
-- La lectura de datos es mas rapida, la escritura es mas lenta.

CREATE INDEX idx_name ON users(name); 
-- La convencion es usar el prefijo idx_ seguido del nombre del campo.

CREATE UNIQUE INDEX idx_name ON users(name);

CREATE UNIQUE INDEX idx_name_surname ON users(name, surname);

DROP INDEX idx_name ON users;
-- Borra el index

# TRIGGER

-- Instrucciones que se ejecutan automaticamente tras un evento en la tabla.

CREATE TABLE 'nombre_de_database' 'email_history' (
    'email_history_id' INT NOT NULL,
    'user_id' INT NOT NULL,
    'email' VARCHAR(100),
    PRIMARY KEY ('email_history_id'),
    UNIQUE INDEX ('email_history_id)'
);

ALTER TABLE 'email_history'
CHANGE COLUMN 'email_history_id' 'email_history_id' INT NOT NULL AUTO_INCREMENT;

Resultado:
TABLE 'email_history' (
    'email_history_id' INT NOT NULL AUTO_INCREMENT,
    'user_id' INT NOT NULL,
    'email' VARCHAR(100),
    PRIMARY KEY ('email_history_id'),
    UNIQUE INDEX 'email_history_id_UNIQUE' ('email_history_id ASC) VISIBLE'
);

-- Crea un trigger llamado "tg_email" que guarda el email previo en la tabla "email_history"
despues(AFTER) que se actualiza(UPDATE) el campo "email" en la tabla "users".

-- DELIMITER es una directiva que guarda la referencia por separado.
Se utiliza cuando se define un bloque de código como un procedimiento donde se requieren múltiples 
instrucciones SQL terminadas con punto y coma dentro de un mismo bloque.

delimiter //

CREATE TRIGGER tg_email
AFTER UPDATE ON users
FOR EACH ROW
BEGIN
	IF OLD.email <> NEW.email THEN
		INSERT INTO email_history (user_id, email) #campos
        VALUES (OLD.user_id, OLD.email); #values
	END IF;
END;

//

-- Restablesco el delimitador
delimiter ;

-- Actualiza el campo "email" del usuario 1 en la tabla "users" para probar el trigger.
UPDATE users SET email = 'mouredev@gmail.com' WHERE user_id = 1

-- Cambios en tabla email_history tras la activacion del trigger
en el cambio de email en la tabla users.

email_history_id   user_id   email
1                  1         
2                  1         correo@viejo.com

-- Elimina el trigger llamado "tg_email"
DROP TRIGGER tg_email;

# VIEW

-- Representacion virtual de una tabla. Tiene sentido si una tabla se consulta habitualmente.
-- Si cambia la tabla que afecta a la vista, esta cambia.
-- Podemos usarla para filtrar informacion que usamos seguido.

CREATE VIEW v_mayores_edad AS <-- Tabla a la que se le asociara
SELECT name, age
FROM users
WHERE age >= 18;

-- Accedo a la vista.
SELECT * FROM v_mayores_edad;

DROP VIEW v_mayores_edad;

# STORED PROCEDURE

-- Una query que guardamos en favoritos.

DELIMITER //

CREATE PROCEDURE p_all_users()
BEGIN
	SELECT * FROM users;

END//

-- Invoca al procedimiento almacenado llamado "p_all_users"
CALL p_all_users;

-- Crea un procedimiento almacenado llamado "p_age_users" parametrizado para
obtener usuarios con edad variable
DELIMITER //
CREATE PROCEDURE p_age_users(IN age_param int)  # condicional, parametro, tipo
BEGIN
	SELECT * FROM users WHERE age = age_param;
END//

-- Invoca al procedimiento almacenado llamado "p_age_users" con un parámetro de valor 30
CALL p_age_users(30);

# TRANSACTION

-- Se ejecuta en un bloque aparte, y se guarda manualmente, o se borra.

START TRANSACTION
-- Inicia una nueva transacción. Desde este punto, todas las modificaciones realizadas en la
base de datos son temporales y solo son visibles dentro de esta transacción.

COMMIT
-- Finaliza una transacción con éxito. Cuando se ejecuta, todos los cambios realizados en la
base de datos durante la transacción actual se hacen permanentes y visibles.

ROLLB ACK
-- Deshace las operaciones realizadas en una transacción, revirtiendo la base de datos
al estado en que se encontraba antes de iniciar la transacción.

# CONNECTORS

-- Ejemplo de conexión desde Python a una base de datos local
-- Se ejemplifica cómo evitar SQL INJECTION

import mysql.connector

def print_user(user):
    config = {
        "host": "127.0.0.1",
        "port": "3306",
        "database": "hello_mysql",
        "user": "root",
        "password": "root1234"
    }
    # config = {
    #     "host": "bpw0hq9h09e7mqicjhtl-mysql.services.clever-cloud.com",
    #     "port": "3306",
    #     "database": "bpw0hq9h09e7mqicjhtl",
    #     "user": "uqzby88erlhvkrty",
    #     "password": "oePXiCOHdU1WRV80NPyv"
    # }

    connection = mysql.connector.connect(**config)
    cursor = connection.cursor()
    query = "SELECT * FROM users WHERE name=%s;"
    print(query)
    cursor.execute(query, (user,))
    result = cursor.fetchall()

    for row in result:
        print(row)

    cursor.close()
    connection.close()

print_user("Brais")
# print_user("'; UPDATE users SET age = '15' WHERE user_id = 1; --")